demos/policy-security-wss-signencrypt/src/test/resources/xml/secure-request.xml

<!--
    JBoss, Home of Professional Open Source
    Copyright 2013, Red Hat, Inc. and/or its affiliates, and individual
    contributors by the @authors tag. See the copyright.txt in the
    distribution for a full listing of individual contributors.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at
    http://www.apache.org/licenses/LICENSE-2.0
    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:switchyard-quickstart-demo:policy-security-wss-signencrypt:0.1.0">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="E51D1C425A3BACB9031367083510323202">MIIB+jCCAWMCBEaul9cwDQYJKoZIhvcNAQEEBQAwRDETMBEGA1UEChMKYXBhY2hlLm9yZzEfMB0GA1UECxMWTk9UIEZPUiBQUk9EVUNUSU9OIFVTRTEMMAoGA1UEAxMDYm9iMB4XDTA3MDczMTAyMDA1NVoXDTM0MTIxNjAyMDA1NVowRDETMBEGA1UEChMKYXBhY2hlLm9yZzEfMB0GA1UECxMWTk9UIEZPUiBQUk9EVUNUSU9OIFVTRTEMMAoGA1UEAxMDYm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC8MXMdlX+satNumqncZY6t4+R6LtaVXRorx1/EdFXhM/Snq3gUx4JNZhv2htZeD1BdIx54e+wGt0JEpxzA9zpN5CHZ8RZ+Kccx7s0R9rSTurTjeH6Nd3JI1UEJ5vKFqPzQttYwnomq5YaxoDGNknGkEDNFBivFxrtWuOPOSWia1QIDAQABMA0GCSqGSIb3DQEBBAUAA4GBADXZjyU7PUXriqVaP+STyApKtRBd8788BPa8JkiX2beH5ZAxZjtM/mwQ10374Qpyy983JradBe31oATvb83ODeVzvMH6t0OPnoZ7t6TJTRox0MKtoYOZAmkt0JXFkhbxk6Tyft4W08UqYnHsUJrHOZ2MyyGp2mLCdGqZgNpVNyQs</wsse:BinarySecurityToken><xenc:EncryptedKey Id="EK-E51D1C425A3BACB9031367083510323201" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:Reference URI="#E51D1C425A3BACB9031367083510323202" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>JovOopwDHFF39WiY3ZvEkK0Jp5SrCgt76Owu8JCNCJaRmwOAS3x0BjUGRoip5ZxDZamx2amtpLl99tyyYwiA1d919Tx2cQl/C7cGTRYJx+Q+Pu4ZzxyowhaJ3vSB7emE8DYU3lebEwjjlo/uE3tfPI18/sEy4KxblBKBWcvnY/o=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-119"/></xenc:ReferenceList></xenc:EncryptedKey><ds:Signature Id="SIG-118" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv urn" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-117"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="urn" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>0pxAQk7p6Z2u1LlepMXO9r37p8A=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>TdUbUUhG3wUu7xrzi8m0E70DYxAaPFXq9P8jkchguZ8/9dTdEZKDh6xFJIEeSds7IRFQxiOL8pUe
aVRjo3YG3k7N6tMqCh/KlOV2qYhKH3Rr+9/27k9Y8SXAF9pLHK3EMS6r8hCclYFnNsIioEwIfP+P
CJn4iSrPheI719MTH2I=</ds:SignatureValue><ds:KeyInfo Id="KI-E51D1C425A3BACB9031367083510314199"><wsse:SecurityTokenReference wsu:Id="STR-E51D1C425A3BACB9031367083510314200"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=alice,OU=NOT FOR PRODUCTION USE,O=apache.org</ds:X509IssuerName><ds:X509SerialNumber>1185847274</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-117" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-119" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-E51D1C425A3BACB9031367083510323201"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>KHhxqVpefbxJb8TdO/Mm5yshhSA8uMNr9fwOExB+CSHyPsfU6gGeZZQ/dr6RD6rGDrHYbsIDlPptKz4WZQlhP8+1rFqxcJ6C6Psd2y7JN+nfhQ0fOukgMlcxtxa2UDAcj8SH49zBfLx2LBY8O7d01PjGudelkWHyScsqj+0sOfSoHWrgYzQcU79GkMlWrNxr9OXVbWS2lGWX0mPOaGmD/ZwB5u/rFTMWloWWH2FchR9z+T0gUaiZ8Uftv9so9HFgX86OVlsCELhH45+Oj4V5Qgt12bh9+gTjoeyow2h1qkScwX09OT4KsogdNV7mVPstDo5FiXpwxyWWyrF0wFLig1gK+PSkBJGxIPqTBihSFxJrZOSMFi5SDuI54gsvZUvAaWS3dGmZfieCzMdJ4Ozwb/1hPaE/Uqtkg/umarw3zkraVjdw8cd+XS7HnAeGEaIZybOwvkJ4PueZjiU6C/EbAwK1uGt15ki5</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>